# 클라우드

 "클라우드"는 인터넷을 통해 액세스할 수 있는 서버와 이러한 서버에서 작동하는 소프트웨어와 데이터베이스를 의미합니다. 클라우드 서버는 전 세계 데이터 센터에 위치합니다.

# 퍼블릭클라우드


 "퍼블릭 클라우드"는 셀프 서비스 인터페이스를 통해 여러 클라이언트 사이에 자동으로 프로비저닝되고 할당되는 가상 리소스 풀로서, 타사가 소유하고 관리하는 하드웨어를 기반으로 개발됩니다. 
 이 클라우드에서는 예상치 못한 수요 변동이 발생하는 워크로드를 간단한 방법으로 확장할 수 있습니다


# 폐쇄망클라우드

'폐쇄망클라우드'제한된 네트워크 상에서 특정 기업이나 특정 사용자만을 대상으로 하는 클라우드로 서비스의 자원과 데이터는 기업 내부에 저장됩니다. 또한 기업이 자원의 제어권을 갖고 있습니다.


# 컨테이너


 '컨테이너는' 소프트웨어 서비스를 실행하는 데 필요한 특정 버전의 프로그래밍 언어 런타임 및 라이브러리와 같은 종속 항목과 애플리케이션 코드를 함께 포함하는 경량 패키지입니다.


# 하이퍼바이저

 '하이퍼바이저'는 가상 머신(Virtual Machine, VM)을 생성하고 구동하는 소프트웨어입니다.
  가상 머신 모니터(Virtual Machine Monitor, VMM)라고도 불리는 하이퍼바이저는 하이퍼바이저 운영 체제와 가상 머신의 리소스를 분리해 VM의 생성과 관리를 지원합니다.


# 오토스케일링

 '오토스케일링'(Auto Scaling)은 클라우드의 유연성을 돋보이게 하는 핵심기술로 CPU, 메모리, 디스크, 네트워크 트래픽과 같은 
  자원들의 메트릭(Metric) 값을 모니터링하여 서버 사이즈를 자동으로 조절합니다.



# daas

# 'DaaS'(Desktop-as-a-Service)는 타사에서 호스팅하는 클라우드 기반 데스크탑 가상화 서비스입니다.
  타사 클라우드 공급업체는 데스크탑 운영 체제를 실행하는 가상 클라우드 머신을 포함하여 데스크탑 스토리지, 컴퓨팅 및 네트워킹과 같은 모든 백엔드 리소스를 관리합니다.
   DaaS(Desktop-as-a-Service) 공급업체는 가상 데스크탑을 사용자 디바이스로 스트리밍하여 언제 어디서나 데스크탑 및 애플리케이션에 액세스할 수 있게 해 줍니다.
    DaaS는 멀티 테넌시를 기반으로 하므로 대부분의 클라우드 서비스 제품과 마찬가지로 구독 기반입니다. 조직은 로컬 데이터센터의 프라이빗 클라우드에서 데스크탑 인프라를 배포할 수도 있습니다.

# vdi

 가상 데스크톱 인프라('VDI')는 가상 머신을 사용하여 가상 데스크톱을 제공하고 관리하는 가상화 솔루션입니다. 
 VDI는 중앙 집중식 서버에서 데스크톱 환경을 호스팅하여 요청 시 최종 사용자에게 배포합니다. 엔드포인트 장치(노트북, 태블릿 및 기타 장치)를 사용하여 네트워크를 통해 액세스합니다.



# iass

클라우드 인프라 서비스라고도 하는 'IaaS'(Infrastructure-as-a-service)는 인터넷을 통해 최종 사용자에게 IT 인프라를 제공하는 형태의 클라우드 컴퓨팅입니다. 
 IaaS는 주로 서버리스 컴퓨팅과 관련이 있습니다.


# paas

 서비스로서의 플랫폼(Platform-as-a-service, 'PaaS')은 하드웨어 및 애플리케이션 소프트웨어 플랫폼이 제3사를 통해 제공되는 클라우드 컴퓨팅의 한 가지 형태입니다. 
 주로 개발자와 프로그래머가 사용하는 PaaS는 보통 해당 프로세스와 관련된 인프라 또는 플랫폼을 구축하고 유지관리할 필요 없이 자체 애플리케이션을 개발, 실행 및 관리 할 수 있도록 해줍니다.


# saas

# 서비스로서의 소프트웨어(Software-as-a-Service, 'SaaS')는 클라우드 애플리케이션과 기본 IT 인프라 및 플랫폼을 사용자에게 제공하는 클라우드 컴퓨팅 형태입니다. 
# 다음과 같은 대기업, 소규모 기업, 개인에게는 SaaS가 적합한 솔루션일 수 있습니다.

# 인프라, 플랫폼, 소프트웨어 유지관리 책임을 맡고 싶지 않은 경우
# 문제 해결을 위해 최소한의 사용자 정의가 필요한 과제가 있는 경우
# 소프트웨어 서브스크립션 모델을 선호하는 경우